export default {
	players: {
		names_1: ['Капитан', 'Паладин', 'Владыка', 'Воин', 'Мастер', 'Рыцарь', 'Магистр', 'Странник', 'Герой', 'Некромант', 'Чародей', 'Пиромант', 'Генерал', 'Командир', 'Лучник', 'Мечник', 'Вор', 'Разбойник', 'Тень', 'Хранитель'],
		names_2: ['Александра', 'Всеволод', 'Никита', 'Фома', 'Ирина', 'Михаил', 'Елена', 'Агап', 'Лукьян', 'Алексей ', 'Лилия', 'Кондрат', 'Артем', 'Наталья', 'Данила', 'Дарья', 'Андрей', 'Ева', 'Егор', 'Клара', 'Юнона', 'Виктор', 'Татьяна', 'Елизар', 'Дина', 'Вадим', 'Кирилл', 'Артур', 'Константин', 'Анна', 'Светлана', 'Максимильян', 'Максим', 'Марина', 'Яна', 'Владилен', 'Сергей', 'Наталия', 'Стела', 'Ангелина', 'Самуил', 'Диана', 'Степан', 'Евгения', 'Илья', 'Кондратий', 'Мирослав', 'Иван', 'Герман', 'Юрий', 'Евгений', 'Дмитрий', 'Мария', 'Агафья', 'Алиса', 'Игорь', 'Роза', 'Потап', 'Полина', 'Доминика', 'Григорий', 'Оксана', 'Валентина', 'Павел', 'Ксения', 'Анисья', 'Надежда', 'Антип', 'Ярослав', 'Руслан', 'Юлия', 'Варвара', 'Владимир', 'Нина', 'Алина', 'Анастасия'],
		adjectives: ['Умный', 'Красивый', 'Бесстрашный', 'Привлекательный', 'Непобедимый', 'Непоколебимый', 'Милый', 'Воинственный', 'Железный', 'Непробиваемый', 'Стойкий', 'Неуязвимый', 'Пушистый', 'Талантливый', 'Ловкий', 'Сообразительный', 'Смелый', 'Титановый', 'Пуленепробиваемый', 'Суперский', 'Мастерский', 'Лапушный', 'Мимимишный', 'Зайчиковый', 'Обалденный', 'Богоподобный', 'Искренний', 'Кайфовый'],
		hp: 100,
		sprites: {
			path: ''
		}
	},
	monsters: {
		names_1: ['Шкурочафк', 'Могилогной', 'Адорыш', 'Адогной', 'Чернодемон', 'Могилочервь', 'Хмурорыш', 'Черночафк', 'Дуборыш', 'Злослон', 'Огнедемон', 'Хмурочервь', 'Демонотрон', 'Краснотрон', 'Хмурогной', 'Шкурокоп', 'Могилочерт', 'Могилохрум', 'Некрослон', 'Воздухомет', 'Землекол', 'Светорез', 'Дубинозавр', 'Светомонстр', 'Булавотерз', 'Ножетерз', 'Водозавр', 'Топоробур', 'Молотобур', 'Черепомаг', 'Астралокид', 'Светобур', 'Воздухорез', 'Копьебур', 'Экспокид', 'Астраломаг', 'Черепотык', 'Ножебур', 'Мечебур', 'Плотокол', 'Темнокол', 'Плотоед', 'Головолом', 'Булавотерз', 'Копьелом', 'Астралокид', 'Землемах', 'Темнобур', 'Молотозавр', 'Некродемон', 'Мегаужас', 'Шкуромерз', 'Некроцап', 'Рогокоп', 'Плотомаг', 'Костемонстр', 'Костелом', 'Экспокид', 'Темнорез', 'Астралобур', 'Плотокол', 'Топоротерз', 'Палицомаг', 'Костелом', 'Дубинотык', 'Пикомаг', 'Пикотерз', 'Огнекид', 'Мечелом', 'Палицомаг', 'Плотобур', 'Светотерз', 'Копьебур', 'Палицозавр', 'Водомонстр', 'Молотомах', 'Мечемаг', 'Пикомах', 'Молотомонстр', 'Палицолом', 'Копьетык', 'Костебур', 'Головотык', 'Темнолом', 'Демоноужас', 'Мегаед', 'Злослон', 'Могилодемон', 'Некротрон', 'Дуборыш', 'Шкуроцап', 'Смерточафк', 'Рогогной', 'Мегачервь', 'Рогозавр', 'Хмурослон', 'Огнецап', 'Злокоп', 'Роготрон', 'Адопуз', 'Хмуродемон', 'Бякокоп', 'Смертозавр', 'Рогохрум', 'Огнедемон', 'Адослон', 'Чернорыш', 'Адогной', 'Бякохрум', 'Демонохрум', 'Кровомерз', 'Дуботруп', 'Кроворыш', 'Грязетрон', 'Бякоужас', 'Кровоцап', 'Демонотрон', 'Адочерт', 'Кровослон', 'Бякохрум'],
		names_2: ['Движухаотик', 'Светохаос', 'Килотрон', 'Коксотрон', 'Вспыходрыг', 'Яркотрой', 'Неотрой', 'Криотрой', 'Гиперслон', 'Гексоглюк', 'Неотрон', 'Гипертаракан', 'Битотрон', 'Килотаракан', 'Психомуха', 'Трансвирус', 'Коксоноль', 'Цифрозомби', 'Роботаракан', 'Гамманоль', 'Бетасталкер', 'Гаммахаотик', 'Мегавирус', 'Робосталкер', 'Темноглюк', 'Яркотаракан', 'Технокрыл', 'Коксобаг', 'Робозомби', 'Килохаос', 'Трансмуха', 'Килокрыл', 'Диждикрыл', 'Роботрой', 'Рободрыг', 'Киломуха', 'Гексохаотик', 'Гаммаснег', 'Битокрыл', 'Терраслон', 'Коксослон', 'Террахаотик', 'Робослон', 'Психолёт', 'Цифроплыв', 'Альфазомби', 'Бетатаракан', 'Движудрыг', 'Гексоноль', 'Трансглюк', 'Терратрой', 'Гексослон', 'Роботаракан', 'Диждиглюк', 'Битовирус', 'Психотрой', 'Темнозомби', 'Рободрыг', 'Светохаос', 'Вспыхотрон', 'Светохаотик', 'Битотрой', 'Бетабаг', 'Ярконоль', 'Вспыхотрой', 'Рободрыг', 'Гамматрон', 'Светокрыл', 'Бетадрыг', 'Психоновик', 'Психовирус', 'Трансзомби', 'Движуснег', 'Трансвирус', 'Битодрыг', 'Темнохаотик', 'Дельтасталкер', 'Робобаг', 'Движуслон', 'Темнохаотик', 'Гаммадрыг', 'Криобаг', 'Движуновик', 'Бетановик', 'Психоснег', 'Неоплыв', 'Темноновик', 'Бетатрой', 'Гаммалёт', 'Вспыхомуха'],
		adjectives: ['Гыгышный', 'Аццкый', 'Пафассный', 'Гламурный', 'Нимецкая', 'Газенвагенскый', 'Пафассный', 'Миталлюгскый', 'Ржачный', 'Падонкаффский', 'Йадовитый', 'Пятибальный', 'Лольный', 'Имошный', 'Анимэшный', 'Албанский', 'Онглискый', 'Ипаццкый', 'Сапожный', 'Онглиский', 'Злобный', 'Сопливый', 'Ужасный', 'Мерзкий', 'Зеленый', 'Плановый', 'Фиолетовый', 'Укуренный', 'Косяковый', 'Оранжевый', 'Косячный', 'Aгрессивный', 'Aзартный', 'Aморальный', 'Безумный', 'Жадный', 'Железный', 'Злой', 'Занудный', 'Коварный', 'Ловкий', 'Наглый', 'Медлительный', 'Осторожный', 'Подозрительный', 'Сумашедший', 'Твердолобы', 'Тупой', 'Тресливый', 'Угрюмый', 'Холодный', 'Цельнометаллический', 'Юродивый', 'Мутный', 'Ловкий', 'Одноглазый', 'Быстрый', 'Пьяный', 'Смертоносный', 'Ловкий', 'Танцующий', 'Черный', 'Дерзкий', 'Бесшумный', 'Ирладский', 'Бешеный ', 'Меткий'],
		hp: 100,
		sprites: {
			head: {
				path: 'src/img/monster/heads/heads.png',
				width: 158,
				height: 180,
				X: [0, 134, 238, 396, 537],
				Y: 0,
			},
			body: {
				path: '../img/monster/bodies/bodies.png',
				width: 162,
				height: 203,
				X: [0, 150, 302, 464, 599],
				Y: 0,
			},
			hands: {
				path: '../img/monster/hands/hands.png',
				width: 293,
				height: 231,
				X: [0, 266, 559, 815, 1108],
				Y: 0,
			},
			legs: {
				path: '../img/monster/legs/legs.png',
				width: 311,
				height: 216,
				X: [0, 180, 381, 587, 898],
				Y: 0,
			}
		}
	},
};
